In [1]:
import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect('cricket.db')

In [6]:
query = "SELECT name FROM players WHERE price > 600000"

In [7]:
dfa = pd.read_sql_query(query, conn)

In [8]:
dfa

    name
0   mahi
1  kohli

In [9]:
print(dfa)

    name
0   mahi
1  kohli

In [11]:
for var in dfa['name']:
    print(var)

mahi
kohli

In [ ]:
#.  4x + 5y  = 20
#   2x + 7y  = 30